app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def show
    if current_subdomain
      @user = User.find_by_subdomain!(current_subdomain)
    else
      @user = User.find(params[:id])